Repository: Sophist-UK/Cura-ArcWelderPlugin
Catalog: i18n/*/arcwelderplugin.po
Languages: it_it

# arcwelder_enable description
source: Convert multiple G0/G1 arc segments into G2/G3 arc movements.
it_it: Converti multipli segmenti d'arco G0/G1 in movimenti d'arco G2/G3.

# arcwelder_g90_influences_extruder label
source: G90 Influences Extruder
it_it: G90 influenza l'estrusore

# arcwelder_g90_influences_extruder description
source: G90/G91 influences the extruder axis mode in the conversion of linear to arc moves. Marlin 2.0 and forks should have this box checked. Many forks of Marlin 1.x should have this unchecked, like the Prusa MK2 and MK3.
it_it: G90/G91 influenzano la modalità dell'asse estrusore nella conversione da movimenti lineari ad archi. Marlin 2.0 e derivazioni dovrebbero avere questa spunta attivata. Molte derivazioni di Marlin 1.x dovrebbero non averla spuntata, come Prusa MK2 e MK3.

# arcwelder_resolution label
source: Resolution (Maximum Path Deviation)
it_it: Risoluzione (Massima deviazione dal percorso)

# arcwelder_resolution description
source: The resolution in mm of the of the output. Determines the maximum tool path deviation allowed in the conversion of linear to arc moves.
it_it: La risoluzione in mm del risultato. Determina la deviazione massima dal percorso nella conversione da movimenti lineari ad archi.

# arcwelder_tolerance label
source: Path Tolerance
it_it: Tolleranza del percorso

# arcwelder_tolerance description
source: The maximum allowable difference between the arc path and the original toolpath in the conversion of linear to arc moves.
it_it: La massima differenza permessa tra percorso dell'arco e percorso originale nella conversione da movimenti lineari ad archi.

# arcwelder_maximum_radius label
source: Maximum Arc Radius
it_it: Massimo raggio dell'arco

# arcwelder_maximum_radius description
source: The maximum radius of any arc in mm.
it_it: Raggio massimo dell'arco in mm.

# arcwelder_allow_3d_arcs label
source: Allow 3D Arcs
it_it: Permetti archi 3D

# arcwelder_allow_3d_arcs description
source: Allow 3d arcs, supporting Spiralize Outer Contour (vase mode). Not all firmware supports this.
it_it: Permetti archi 3D, supporta il contorno spiralizzato (modalità vaso). Non tutti i firmware lo supportano.

# arcwelder_allow_travel_arcs label
source: Allow Travel Arcs
it_it: Permetti spostamenti ad arco

# arcwelder_allow_travel_arcs description
source: Allow converting travel moves to arcs.
it_it: Permetti di convertire in archi i movimenti di spostamento

# arcwelder_allow_dynamic_precision label
source: Allow Dynamic Precision
it_it: Permetti precisione dinamica

# arcwelder_allow_dynamic_precision description
source: Allow the precision to grow as ArcWelder encounters gcodes with higher precision. This may increase gcode size somewhat, depending on the precision of the gcode commands in your file.
it_it: Permetti di aumentare la precisione quando ArcWelder incontra gcodes con precisione maggiore. Questo può incrementare in qualche modo lo spazio occupato dal gcode, a seconda della precisione dei comandi nel tuo file gcode.

# arcwelder_default_xyz_precision label
source: Default XYZ Precision
it_it: Precisione XYZ predefinita

# arcwelder_default_xyz_precision description
source: The number of decimal places of coordinates of arc segments in the X, Y and Z axes. When combined with the 'Allow Dynamic Precision' setting, this represents the minimum precision.
it_it: Il numero di cifre decimali delle coordinate dei segmenti d'arco sugli assi X, Y e Z. Quando combinato con l'impostazione 'Permetti precisione dinamica', questo rappresenta la precisione minima.

# arcwelder_default_e_precision label
source: Default E Precision
it_it: Precisione predefinita di E

# arcwelder_default_e_precision description
source: The number of decimal places of coordinates of arc segments in the E axis. When combined with the 'Allow Dynamic Precision' setting, this represents the minimum precision.
it_it: Il numero di cifre decimali delle coordinate dei segmenti d'arco sull'asse E. Quando combinato con l'impostazione 'Permetti precisione dinamica', questo rappresenta la precisione minima.

# arcwelder_firmware_compensation label
source: Firmware Compensation
it_it: Compensazione del firmware

# arcwelder_firmware_compensation description
source: Some firmware does not handle arcs with a small radius (under approximately 5mm depending on your settings), which will appear flat instead of curved. If larger arcs appear flat, it's likely that G2/G3 is disabled. This applies to Marlin 1.x (but NOT Marlin 2), Klipper (can be fixed by changing settings), and a few others. If you notice small radius arcs that print with a flat edge, you may need to enable firmware compensation. Note that compression may be reduced (perhaps drastically) when firmware compensation is enabled.
it_it: Alcuni firmware non gestiscono archi con raggio piccolo (inferiori ad circa 5mm a seconda delle tue impostazioni), questi appariranno piatti invece che curvi. Se gli archi più grandi appaiono piatti, allora quasi certamente G2/G3 sono disabilitati. Questo si applica a Marlin 1.x (ma NON a Marlin 2), Klipper (può essere sistemato cambiando le impostazioni), e pochi altri. Se noti che archi dal raggio piccolo vengono stampati con un bordo piatto, potresti dover abilitare la compensazione firmware. Nota che la compressione può essere ridotta (forse drasticamente) quando la compensazione firmware è abilitata.

# arcwelder_mm_per_arc_segment label
source: Millimeters Per Arc Segment
it_it: Millimetri per segmento d'arco

# arcwelder_mm_per_arc_segment description
source: The mm per arc segment as defined in your firmware. Used to compensate for firmware without mini-arc-segments setting.
it_it: I mm per segmento d'arco cosi come definiti nel tuo firmware. Usato per compensare firmware sprovvisti di impostazione per mini-segmenti-d'arco.

# arcwelder_min_arc_segment label
source: Minimum Arc Segments
it_it: Segmenti minimi dell'arco

# arcwelder_min_arc_segment description
source: The minimum number of segments in a full circle of the same radius as any given arc. Used to compensate for firmware without min-arc-segments setting.
it_it: Il numero minimo di segmenti in un cerchio completo dello stesso raggio di un dato arco. Usato per compensare firmware sprovvisti di impostazione per mini-segmenti-d'arco.

# arcwelder_extrusion_rate_variance label
source: Extrusion Rate Variance
it_it: Variazione della velocità di estrusione

# arcwelder_extrusion_rate_variance description
source: Abort arc generation if the extrusion rate changes more than the percent specified. This enhances quality and provides support for Cura Arachne engine with variable line width. Enter 0% to disable.
it_it: Annulla la generazione dell'arco se la velocità di estrusione varia più della percentuale specificata. Questo migliora la qualità e fornisce supporto per il motore Cura Arachne con larghezza di linea variabile. Inserisci 0% per disabilitare.

# arcwelder_max_gcode_length label
source: Maximum G-code Length
it_it: Massima lunghezza del G-code

# arcwelder_max_gcode_length description
source: Terminate arc generation if the resulting gcode contains more characters than this setting. Some firmware have issues with long gocde commands. Enter 0 for no limit.
it_it: Termina la generazione dell'arco se il gcode risultante contiene più caratteri di questa impostazione. Alcuni firmware hanno problemi con comandi gcode lunghi. Inserire 0 per non avere limiti.
